bench/custom/logs/rfuse/ramdisk/origin/rfuse_write_0-15.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=4690: Wed May 29 13:24:32 2024
  write: IOPS=127k, BW=497MiB/s (521MB/s)(32.0GiB/65919msec); 0 zone resets
    clat (usec): min=7, max=25652, avg=199.78, stdev=236.60
     lat (usec): min=7, max=25652, avg=199.84, stdev=236.60
    clat percentiles (usec):
     |  1.00th=[   17],  5.00th=[   43], 10.00th=[   65], 20.00th=[   78],
     | 30.00th=[   85], 40.00th=[   90], 50.00th=[   96], 60.00th=[  125],
     | 70.00th=[  269], 80.00th=[  293], 90.00th=[  367], 95.00th=[  627],
     | 99.00th=[ 1106], 99.50th=[ 1205], 99.90th=[ 1385], 99.95th=[ 1549],
     | 99.99th=[ 7963]
   bw (  KiB/s): min=302214, max=2172456, per=100.00%, avg=666031.46, stdev=17225.63, samples=3338
   iops        : min=75550, max=543114, avg=166505.43, stdev=4306.43, samples=3338
  lat (usec)   : 10=0.06%, 20=1.46%, 50=4.66%, 100=47.60%, 250=12.72%
  lat (usec)   : 500=24.65%, 750=6.99%, 1000=0.45%
  lat (msec)   : 2=1.37%, 4=0.01%, 10=0.02%, 20=0.01%, 50=0.01%
  cpu          : usr=0.32%, sys=53.93%, ctx=912184877, majf=0, minf=468
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=497MiB/s (521MB/s), 497MiB/s-497MiB/s (521MB/s-521MB/s), io=32.0GiB (34.4GB), run=65919-65919msec