bench/custom/logs/rfuse/ramdisk/origin/rfuse_write_0-3.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=4227: Wed May 29 13:18:35 2024
  write: IOPS=54.7k, BW=214MiB/s (224MB/s)(32.0GiB/153244msec); 0 zone resets
    clat (usec): min=6, max=90909, avg=449.53, stdev=976.23
     lat (usec): min=6, max=90910, avg=449.60, stdev=976.24
    clat percentiles (usec):
     |  1.00th=[   22],  5.00th=[   29], 10.00th=[   85], 20.00th=[  155],
     | 30.00th=[  227], 40.00th=[  245], 50.00th=[  258], 60.00th=[  281],
     | 70.00th=[  359], 80.00th=[  400], 90.00th=[  725], 95.00th=[  898],
     | 99.00th=[ 7308], 99.50th=[ 7767], 99.90th=[ 7898], 99.95th=[ 7963],
     | 99.99th=[ 8029]
   bw (  KiB/s): min=163996, max=1751277, per=100.00%, avg=312394.44, stdev=10799.95, samples=7501
   iops        : min=40991, max=437817, avg=78091.06, stdev=2700.04, samples=7501
  lat (usec)   : 10=0.19%, 20=0.71%, 50=4.91%, 100=5.15%, 250=33.45%
  lat (usec)   : 500=42.28%, 750=4.59%, 1000=5.76%
  lat (msec)   : 2=0.57%, 4=0.03%, 10=2.35%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.19%, sys=15.08%, ctx=1004880661, majf=0, minf=300
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=214MiB/s (224MB/s), 214MiB/s-214MiB/s (224MB/s-224MB/s), io=32.0GiB (34.4GB), run=153244-153244msec