bench/custom/logs/rfuse/ramdisk/origin/rfuse_write_0-31.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=5019: Wed May 29 13:26:57 2024
  write: IOPS=122k, BW=477MiB/s (500MB/s)(32.0GiB/68656msec); 0 zone resets
    clat (usec): min=6, max=41565, avg=233.30, stdev=325.61
     lat (usec): min=6, max=41565, avg=233.39, stdev=325.62
    clat percentiles (usec):
     |  1.00th=[   19],  5.00th=[   55], 10.00th=[  133], 20.00th=[  155],
     | 30.00th=[  172], 40.00th=[  192], 50.00th=[  215], 60.00th=[  233],
     | 70.00th=[  247], 80.00th=[  262], 90.00th=[  297], 95.00th=[  482],
     | 99.00th=[  635], 99.50th=[  734], 99.90th=[ 7963], 99.95th=[ 7963],
     | 99.99th=[ 8029]
   bw (  KiB/s): min=394904, max=1374984, per=100.00%, avg=551563.38, stdev=8873.25, samples=3901
   iops        : min=98726, max=343746, avg=137890.80, stdev=2218.31, samples=3901
  lat (usec)   : 10=0.01%, 20=1.33%, 50=3.48%, 100=1.67%, 250=66.43%
  lat (usec)   : 500=22.67%, 750=3.95%, 1000=0.21%
  lat (msec)   : 2=0.06%, 4=0.04%, 10=0.16%, 20=0.01%, 50=0.01%
  cpu          : usr=0.40%, sys=89.70%, ctx=230585475, majf=0, minf=696
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=477MiB/s (500MB/s), 477MiB/s-477MiB/s (500MB/s-500MB/s), io=32.0GiB (34.4GB), run=68656-68656msec