bench/custom/logs/rfuse/ramdisk/origin/rfuse_write_0-7.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=4455: Wed May 29 13:22:09 2024
  write: IOPS=61.1k, BW=239MiB/s (250MB/s)(32.0GiB/137237msec); 0 zone resets
    clat (usec): min=7, max=71679, avg=520.67, stdev=122.92
     lat (usec): min=7, max=71679, avg=520.74, stdev=122.92
    clat percentiles (usec):
     |  1.00th=[  147],  5.00th=[  461], 10.00th=[  474], 20.00th=[  482],
     | 30.00th=[  494], 40.00th=[  502], 50.00th=[  510], 60.00th=[  529],
     | 70.00th=[  537], 80.00th=[  562], 90.00th=[  594], 95.00th=[  619],
     | 99.00th=[  750], 99.50th=[  906], 99.90th=[ 1012], 99.95th=[ 1057],
     | 99.99th=[ 1237]
   bw (  KiB/s): min=212530, max=587812, per=100.00%, avg=244621.49, stdev=1274.06, samples=8722
   iops        : min=53131, max=146945, avg=61151.40, stdev=318.53, samples=8722
  lat (usec)   : 10=0.01%, 20=0.13%, 50=0.58%, 100=0.06%, 250=0.44%
  lat (usec)   : 500=37.50%, 750=60.30%, 1000=0.87%
  lat (msec)   : 2=0.12%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.19%, sys=24.10%, ctx=1961054385, majf=0, minf=312
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=239MiB/s (250MB/s), 239MiB/s-239MiB/s (250MB/s-250MB/s), io=32.0GiB (34.4GB), run=137237-137237msec