bench/custom/logs/rfuse/ramdisk/origin/rfuse_write_0.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=3762: Wed May 29 13:07:51 2024
  write: IOPS=8284, BW=32.4MiB/s (33.9MB/s)(32.0GiB/1012537msec); 0 zone resets
    clat (usec): min=8, max=87761, avg=3860.80, stdev=516.01
     lat (usec): min=8, max=87761, avg=3860.87, stdev=516.01
    clat percentiles (usec):
     |  1.00th=[ 3294],  5.00th=[ 3458], 10.00th=[ 3523], 20.00th=[ 3589],
     | 30.00th=[ 3654], 40.00th=[ 3752], 50.00th=[ 3884], 60.00th=[ 3982],
     | 70.00th=[ 4047], 80.00th=[ 4146], 90.00th=[ 4359], 95.00th=[ 4490],
     | 99.00th=[ 4686], 99.50th=[ 4817], 99.90th=[ 5538], 99.95th=[ 6194],
     | 99.99th=[ 7570]
   bw (  KiB/s): min=28372, max=125044, per=100.00%, avg=33157.19, stdev=79.63, samples=64463
   iops        : min= 7089, max=31248, avg=8278.79, stdev=19.88, samples=64463
  lat (usec)   : 10=0.01%, 20=0.04%, 50=0.12%, 100=0.03%, 250=0.27%
  lat (usec)   : 500=0.42%, 750=0.04%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=63.17%, 10=35.88%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.03%, sys=3.00%, ctx=1544824845, majf=0, minf=308
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=32.4MiB/s (33.9MB/s), 32.4MiB/s-32.4MiB/s (33.9MB/s-33.9MB/s), io=32.0GiB (34.4GB), run=1012537-1012537msec