bench/custom/logs/rfuse/ramdisk/origin/rfuse_write_ramdisk_none.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=4306: Thu May 30 02:48:07 2024
  write: IOPS=1402k, BW=5478MiB/s (5744MB/s)(32.0GiB/5982msec); 0 zone resets
    clat (usec): min=6, max=25071, avg=20.52, stdev=10.50
     lat (usec): min=6, max=25071, avg=20.63, stdev=10.52
    clat percentiles (nsec):
     |  1.00th=[10432],  5.00th=[12864], 10.00th=[14272], 20.00th=[15936],
     | 30.00th=[17536], 40.00th=[18816], 50.00th=[20096], 60.00th=[21376],
     | 70.00th=[22656], 80.00th=[24192], 90.00th=[26752], 95.00th=[29312],
     | 99.00th=[38656], 99.50th=[43264], 99.90th=[60672], 99.95th=[68096],
     | 99.99th=[88576]
   bw (  MiB/s): min= 4780, max= 7114, per=100.00%, avg=5816.67, stdev=20.04, samples=334
   iops        : min=1223770, max=1821422, avg=1489065.13, stdev=5129.10, samples=334
  lat (usec)   : 10=0.62%, 20=48.62%, 50=50.54%, 100=0.21%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 50=0.01%
  cpu          : usr=4.39%, sys=33.89%, ctx=8425574, majf=0, minf=467
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=5478MiB/s (5744MB/s), 5478MiB/s-5478MiB/s (5744MB/s-5744MB/s), io=32.0GiB (34.4GB), run=5982-5982msec